[
    {
        "head": "The Modern JavaScript Tutorial",
        "para1": "How it's done now. From the basics to advanced topics with simple, but detailed explanations.",
        "para2": "Main course contains 2 parts which cover JavaScript as a programming language and working with a browser. There are also additional series of thematic articles.",
        "para3": "Here we learn JavaScript, starting from scratch and go on to advanced concepts like OOP.",
        "link": "https://javascript.info/"
    },
    {
        "head": "JavaScript Mastery - Complete Path to JavaScript Mastery",
        "para1": "The course covers everything you need to be an outstanding JavaScript Developer who is ready to learn any framework or library.        ",
        "para2": "Having a solid foundation of JavaScript is crucial before diving into any frameworks or libraries. This course will give you a deep understanding of JavaScript and all of its advantages:",
        "para3": "This course will get you prepared to dive straight into the most popular tools & technologies, and frameworks and libraries.",
        "link": "https://www.jsmastery.pro/complete-path-to-javascript-mastery",
        "videoLink": "https://www.youtube.com/embed/g7T23Xzys-A"
    },
    {
        "head": "FreeCodeCamp - JavaScript Algorithms and Data Structures  ",
        "para1": "While HTML and CSS control the content and styling of a page, JavaScript is used to make it interactive. In the JavaScript Algorithm and Data Structures Certification, you'll learn the fundamentals of JavaScript including variables, arrays, objects, loops, and functions. ",
        "para2": "Once you have the fundamentals down, you'll apply that knowledge by creating algorithms to manipulate strings, factorialize numbers, and even calculate the orbit of the International Space Station.",
        "para3": "Along the way, you'll also learn two important programming styles or paradigms: Object Oriented Programming (OOP) and Functional Programming (FP).   ",
        "link": "https://www.freecodecamp.org/learn/javascript-algorithms-and-data-structures/",
        "videoLink": "https://www.youtube.com/embed/PkZNo7MFNFg"
    },
    {
        "head": "30 Day Vanilla JS Coding Challenge",
        "para1": "Beginner to Intermediate developers and designers who want to become comfortable with both JavaScript fundamentals and working in the DOM without a library.",
        "para2": "We learn by application - encountering many new situations while talking about the hows, the whys and the whats that we use to solve them.",
        "para3": "We steer clear of opinionated design patterns, frameworks, libraries and any type of abstraction. These things are great and often needed, but can obstruct learning and constrain initial understanding.",
        "link": "https://javascript30.com/",
        "videoLink": "https://www.youtube.com/embed/VuN8qwZoego"
    }
]