[
    {   
        "superehead": "HTML and CSS Resources:",
        "head": "The Net Ninja - HTML & CSS Crash Course",
        "para1": " If you're brand new to web development and ant to get started building websites, then look no further than this introduction to HTML & CSS",
        "para2": "HTML & CSS are the core building blocks of front-end web development and are used to structure website content and control the visual design of them too.",
        "para3": "By the end of this course you'll have a great foundation in front-end web development & will be able to make your own responsive websites from scratch.",
        "link": "https://netninja.dev/p/html-css-crash-course",
        "videoLink": "https://www.youtube.com/embed/hu-q2zYwEYs"
    },
    {
        "head": "FreeCodeCamp - HTML for Beginners",
        "para1": " This article will teach you the basics of HTML.Also created a 45-minute video course on the freeCodeCamp.org YouTube channel that teaches you HTML in the context of creating an actual web page.",
        "para2": "If you are just learning HTML, We recommend both reading this article and watching the video course.",
        "para3": "HTML stands for Hyper Text Markup Language. Every website on the internet uses HTML & CSS. Most also use JavaScript.",
        "link": "https://www.freecodecamp.org/news/html-crash-course/",
        "videoLink": "https://www.youtube.com/embed/kUMe1FH4CHE"
    },
    {
        "head": "Bro Code - HTML & CSS Full Course",
        "para1": "This course will teach you the basics of HTML.This 6 hour video course on the Bro Code YouTube channel that teaches you HTML and CSS in the context of creating an actual responsive web page.",
        "para2": "If you are just learning HTML, I recommend both reading this article and watching the video course.",
        "para3": "HTML stands for Hyper Text Markup Language. Every website on the internet uses HTML & CSS. Most also use JavaScript.",
        "videoLink": "https://www.youtube.com/embed/cyuzt1Dp8X8"
    },
    {
        "head": "FreeCodeCamp - CSS Zero to Hero",
        "para1": "It is important for all web developers to be familiar with CSS, or Cascading Style Sheets. CSS is responsible for the styling and looks of a website. Learn how to use it in this complete 6-hour course for beginners from Jad Khalili.k",
        "para2": "This free video course covers CSS from the ground up. You will learn everything from basic skills, such as coloring and text, to highly advanced skills, like custom animations.",
        "para3": "Learn CSS in this free 6-hour video course",
        "link": "https://www.freecodecamp.org/news/learn-css-in-this-free-6-hour-video-course/",
        "videoLink": "https://www.youtube.com/embed/1Rs2ND1ryYc"
    }
]