[
    {
        "head": "Introducing react.dev",
        "para1": "The Learn section begins with the Quick Start page. It is a short introductory tour of React. It introduces the syntax for concepts like components, props, and state, but doesn’t go into much detail on how to use them.",
        "para2": "This is why the Learn section is organized like a self-paced course split into chapters. The first two chapters describe the fundamentals of React. If you’re new to React, or want to refresh it in your memory, start here:",
        "para3": "We'd like everyone in the world to have an equal opportunity to learn React for free on their own.",
        "link": "https://react.dev/blog/2023/03/16/introducing-react-dev"
    },
    {
        "head": "FreeCodeCamp - Learn React JS",
        "para1": "React is a popular JavaScript library for building reusable, component-driven user interfaces for web pages or applications.",
        "para2": "React combines HTML with JavaScript functionality into its own markup language called JSX. React also makes it easy to manage the flow of data throughout the application.",
        "para3": "In this course, you'll learn how to create different React components, manage data in the form of state props, use different lifecycle methods like componentDidMount, and much more.",
        "link": "https://www.freecodecamp.org/learn/front-end-development-libraries/#react"
    },
    {
        "head": "FreeCodeCamp - Beginner's Tutorial for React JS",
        "para1": "React is a declarative, efficient, and flexible JavaScript library for building user interfaces. We just released a full React course on the freeCodeCamp.org YouTube channel.",
        "para2": "Thomas Weibenfalk created this course. He is an excellent developer and has developed many great courses.",
        "para3": "In this course, you will learn React.js from the ground up starting with the fundamentals all the way to more intermediate and advanced topics. You will learn by building a real app.",
        "link": "https://www.freecodecamp.org/news/learn-react-js-in-this-free-7-hour-course/",
        "videoLink": "https://www.youtube.com/embed/bMknfKXIFA8"
    }
]