[
    {
        "head": "The Net Ninja - HTML & CSS Crash Course",
        "para1": " If you're brand new to web development and ant to get started building websites, then look no further than this introduction to HTML & CSS",
        "para2": "HTML & CSS are the core building blocks of front-end web development and are used to structure website content and control the visual design of them too.",
        "para3": "By the end of this course you'll have a great foundation in front-end web development & will be able to make your own responsive websites from scratch.",
        "link": "https://netninja.dev/p/html-css-crash-course",
        "videoLink": "https://www.youtube.com/embed/hu-q2zYwEYs"
    },
    {
        "head": "FreeCodeCamp - HTML for Beginners",
        "para1": " This article will teach you the basics of HTML.Also created a 45-minute video course on the freeCodeCamp.org YouTube channel that teaches you HTML in the context of creating an actual web page.",
        "para2": "If you are just learning HTML, I recommend both reading this article and watching the video course.",
        "para3": "HTML stands for Hyper Text Markup Language. Every website on the internet uses HTML & CSS. Most also use JavaScript.",
        "link": "https://www.freecodecamp.org/news/html-crash-course/",
        "videoLink": "https://www.youtube.com/embed/kUMe1FH4CHE"
    },
    {
        "head": "Bro Code - HTML & CSS Full Course",
        "para1": "This course will teach you the basics of HTML.This 6 hour video course on the Bro Code YouTube channel that teaches you HTML and CSS in the context of creating an actual responsive web page.",
        "para2": "If you are just learning HTML, I recommend both reading this article and watching the video course.",
        "para3": "HTML stands for Hyper Text Markup Language. Every website on the internet uses HTML & CSS. Most also use JavaScript.",
        "videoLink": "https://www.youtube.com/embed/cyuzt1Dp8X8"
    },
    {
        "head": "The Net Ninja - HTML & CSS Crash Course",
        "para1": "If you're brand new to web development and ant to get started building websites, then look no further than this introduction to HTML & CSS.",
        "para2": "HTML & CSS are the core building blocks of front-end web development and are used to structure website content and control the visual design of them too.",
        "para3": "By the end of this course you'll have a great foundation in front-end web development & will be able to make your own responsive websites from scratch.",
        "link": "https://www.youtube.com/playlist?list=PL4cUxeGkcC9ivBf_eKCPIAYXWzLlPAm6G",
        "videoLink": "https://www.youtube.com/embed/hu-q2zYwEYs"
    },
    {
        "head": "FreeCodeCamp - CSS Zero to Hero",
        "para1": "It is important for all web developers to be familiar with CSS, or Cascading Style Sheets. CSS is responsible for the styling and looks of a website. Learn how to use it in this complete 6-hour course for beginners from Jad Khalili.k",
        "para2": "This free video course covers CSS from the ground up. You will learn everything from basic skills, such as coloring and text, to highly advanced skills, like custom animations.",
        "para3": "Learn CSS in this free 6-hour video course",
        "link": "https://www.freecodecamp.org/news/learn-css-in-this-free-6-hour-video-course/",
        "videoLink": "https://www.youtube.com/embed/1Rs2ND1ryYc"
    },
    {
        "head": "Bro Code - HTML & CSS Full Course",
        "para1": "This course will teach you the basics of HTML.This 6 hour video course on the  Bro Code YouTube channel that teaches you HTML and CSS in the context of creating an actual  responsive web page.",
        "para2": "If you are just learning HTML, I recommend, watching the video course.",
        "para3": "HTML stands for Hyper Text Markup Language. Every website on the  internet uses HTML & CSS. Most also use JavaScript.",
        "videoLink": "https://www.youtube.com/embed/cyuzt1Dp8X8"
    },
    {
        "head": "The Modern JavaScript Tutorial",
        "para1": "How it's done now. From the basics to advanced topics with simple, but detailed explanations.",
        "para2": "Main course contains 2 parts which cover JavaScript as a programming language and working with a browser. There are also additional series of thematic articles.",
        "para3": "Here we learn JavaScript, starting from scratch and go on to advanced concepts like OOP.",
        "link": "https://javascript.info/",
        "image": "/src/assets/img/roadmap/modernJs.png"
    },
    {
        "head": "JavaScript Mastery - Complete Path to JavaScript Mastery",
        "para1": "The course covers everything you need to be an outstanding JavaScript Developer who is ready to learn any framework or library.        ",
        "para2": "Having a solid foundation of JavaScript is crucial before diving into any frameworks or libraries. This course will give you a deep understanding of JavaScript and all of its advantages:",
        "para3": "This course will get you prepared to dive straight into the most popular tools & technologies, and frameworks and libraries.",
        "link": "https://www.jsmastery.pro/complete-path-to-javascript-mastery",
        "videoLink": "https://www.youtube.com/embed/g7T23Xzys-A"
    },
    {
        "head": "FreeCodeCamp - JavaScript Algorithms and Data Structures  ",
        "para1": "While HTML and CSS control the content and styling of a page, JavaScript is used to make it interactive. In the JavaScript Algorithm and Data Structures Certification, you'll learn the fundamentals of JavaScript including variables, arrays, objects, loops, and functions. ",
        "para2": "Once you have the fundamentals down, you'll apply that knowledge by creating algorithms to manipulate strings, factorialize numbers, and even calculate the orbit of the International Space Station.",
        "para3": "Along the way, you'll also learn two important programming styles or paradigms: Object Oriented Programming (OOP) and Functional Programming (FP).   ",
        "link": "https://www.freecodecamp.org/learn/javascript-algorithms-and-data-structures/",
        "videoLink": "https://www.youtube.com/embed/PkZNo7MFNFg"
    },
    {
        "head": "30 Day Vanilla JS Coding Challenge",
        "para1": "Beginner to Intermediate developers and designers who want to become comfortable with both JavaScript fundamentals and working in the DOM without a library.",
        "para2": "We learn by application - encountering many new situations while talking about the hows, the whys and the whats that we use to solve them.",
        "para3": "We steer clear of opinionated design patterns, frameworks, libraries and any type of abstraction. These things are great and often needed, but can obstruct learning and constrain initial understanding.",
        "link": "https://javascript30.com/",
        "videoLink": "https://www.youtube.com/embed/VuN8qwZoego"
    },
    {
        "head": "Documentation - Get started with Tailwind CSS",
        "para1": "Tailwind CSS works by scanning all of your HTML files, JavaScript components, and any other templates for class names, generating the corresponding styles and then writing them to a static CSS file.",
        "para2": "Tailwind CSS is the only framework that I've seen scale on large teams. It’s easy to customize, adapts to any design, and the build size is tiny.",
        "para3": "Rapidly build modern websites without ever leaving your HTML.",
        "link": "https://tailwindcss.com/docs/installation",
        "image": "/src/assets/img/roadmap/tailwind.png"
    },
    {
        "head": "The Net Ninja - Tailwind CSS Tutorial",
        "para1": "Tailwind is a utitlity-first CSS framework - meaning it provides us with a bunch of utility classes which we can use to style our websites, rather than pre-defined components such as modals, breadcrumbs & tabbed content.",
        "para2": "That's in contrast to other CSS frameworks like Bootstrap, which is component based.",
        "para3": "In this Tailwind CSS course you'll learn how to set Tailwind up & create a smple website with it from scratch.",
        "link": "https://netninja.dev/p/tailwind-css-tutorial",
        "videoLink": "https://www.youtube.com/embed/bxmDnn7lrnk"
    },
    {
        "head": "Introducing react.dev",
        "para1": "The Learn section begins with the Quick Start page. It is a short introductory tour of React. It introduces the syntax for concepts like components, props, and state, but doesn’t go into much detail on how to use them.",
        "para2": "This is why the Learn section is organized like a self-paced course split into chapters. The first two chapters describe the fundamentals of React. If you’re new to React, or want to refresh it in your memory, start here:",
        "para3": "We’d like everyone in the world to have an equal opportunity to learn React for free on their own.",
        "link": "https://react.dev/blog/2023/03/16/introducing-react-dev",
        "image": "/src/assets/img/roadmap/react.png"
    },
    {
        "head": "FreeCodeCamp - Learn React JS",
        "para1": "React is a popular JavaScript library for building reusable, component-driven user interfaces for web pages or applications.",
        "para2": "React combines HTML with JavaScript functionality into its own markup language called JSX. React also makes it easy to manage the flow of data throughout the application.",
        "para3": "In this course, you'll learn how to create different React components, manage data in the form of state props, use different lifecycle methods like componentDidMount, and much more.",
        "link": "https://www.freecodecamp.org/learn/front-end-development-libraries/#react",
        "image": "/src/assets/img/roadmap/reactfreecodecamp.png"
    },
    {
        "head": "FreeCodeCamp - Beginner's Tutorial for React JS",
        "para1": "React is a declarative, efficient, and flexible JavaScript library for building user interfaces. We just released a full React course on the freeCodeCamp.org YouTube channel.",
        "para2": "Thomas Weibenfalk created this course. He is an excellent developer and has developed many great courses.",
        "para3": "In this course, you will learn React.js from the ground up starting with the fundamentals all the way to more intermediate and advanced topics. You will learn by building a real app.",
        "link": "https://www.freecodecamp.org/news/learn-react-js-in-this-free-7-hour-course/",
        "videoLink": "https://www.youtube.com/embed/bMknfKXIFA8"
    },
    {
        "head": "Codevolution - Next.js Tutorial",
        "para1": "Next.js is a react framework for production. Next.js gives you the best developer experience with all the features you need for production: hybrid static & server rendering, TypeScript support, smart bundling, route pre-fetching, and more. No config needed.",
        "para2": "Next.js handles the tooling and configuration needed for React, and provides additional structure, features, and optimizations for your application.",
        "para3": "You will learn how to build a full-stack App from scratch.",
        "videoLink": "https://www.youtube.com/embed/9P8mASSREYM"
    },
    {
        "head": "The Net Ninja - Getting Started with Next.js",
        "para1": "Next.js is a modern React framework for creating lighting-fast, static websites, but also comes with the added ability of SSR (server-side rendering).",
        "para2": "In this Next.js tutorial series we'll learn how to create a Next.js application from the ground up & see how to deploy it to the web using Vercel & GitHub.",
        "para3": "You'll learn how to create a website with Next (& React) - including pages, routes, layouts, fetching data & deployment.",
        "link": "https://netninja.dev/p/getting-started-with-next-js",
        "videoLink": "https://www.youtube.com/embed/A63UxsQsEbU"
    },
    {
        "head": "Documentation - Vue JavaScriipt",
        "para1": "Vue (pronounced /vjuː/, like view) is a progressive framework for building user interfaces. Unlike other monolithic frameworks, Vue is designed from the ground up to be incrementally adoptable.",
        "para2": "The core library is focused on the view layer only, and is easy to pick up and integrate with other libraries or existing projects. ",
        "para3": " On the other hand, Vue is also perfectly capable of powering sophisticated Single-Page Applications when used in combination with modern tooling and supporting libraries.",
        "link": "https://v2.vuejs.org/v2/guide/installation.html?redirect=true",
        "image": "/src/assets/img/roadmap/vue.png"
    },
    {
        "head": "The Net Ninja - Vue JS 3 Tutorial",
        "para1": "Vue (pronounced /vjuː/, like view) is a progressive framework for building user interfaces. Unlike other monolithic frameworks, Vue is designed from the ground up to be incrementally adoptable.",
        "para2": "The core library is focused on the view layer only, and is easy to pick up and integrate with other libraries or existing projects. ",
        "para3": " On the other hand, Vue is also perfectly capable of powering sophisticated Single-Page Applications when used in combination with modern tooling and supporting libraries.",
        "link": "",
        "videoLink": "https://www.youtube.com/embed/YrxBCBibVo0"
    }
]